; Sam Toki's MacType Configuration - Sarasa UI J
; Modified by SAM TOKI STUDIO
; 原始文件 (Original file) by maxchow@qq.com
; v12.01 (2026/01/12)
; 参考资料 (Reference): https://github.com/snowie2000/mactype/wiki

; －－－－－基本信息－－－－－

[Preview]
Text="Sam Toki's MacType Configuration - Sarasa UI J v12.01 (2026/01/12)"
Font=Sarasa UI J
Size=9
Color=$A04080
Align=Left

[General]
Name="Sam Toki's MacType Configuration - Sarasa UI J"

; －－－－－载入设定－－－－－

; 自动挂钩子进程
; 0: 禁用 1: 启用
; 默认: 0 推荐: 1
HookChildProcesses=1

; 字体载入方法
; 注意是载入方法, 不是渲染方法。很多 FreeType 的设定需要该设定选0才有效。
; 0: 用 FreeType 载入字体 1: 用 Windows 的绘图核心载入字体
; 默认: 0 推荐: 0
FontLoader=0

; 按需载入字体
; 0: 启动时预载入所有字体 1: 首次使用时再载入 (减少内存占用)
; 默认: 0 推荐: 1
LoadOnDemand=1

; UseMapping
; 决定是否将完整字体数据映射到内存, 以减少对 GDI GetFontData 的多次调用, 提高 FreeType 载入性能。但会占用相当于字体数据大小的额外内存。仅在 FontLoader=0 (用 FreeType 载入字体) 时有效。
; 0: 禁用。每次读取时调用 GetFontData, 不额外占用内存。
; 1: 启用。使用 CreateFileMapping/MapViewOfFile 将整个字体数据载入到内存, 并在 FT_Stream 读取时直接 memcpy。
; 默认: 0 推荐: 0
UseMapping=0

; 字体链接
; 当 FontLoader=0 时 0: 什么都不做 1: 使用注册表里的字体链接设定, 通过 FreeType 的字符表进行查找 2: 使用注册表里的字体链接设定, 使用 Windows 的转换函数直接查找。
; 当 FontLoader=1 时保持启用的状态, 但是所有字体链接的处理会交由 WIN32API 完成。
; 默认: 0 推荐: 2
FontLink=2

; 字体替换
; 当 FontLoader=0 时 0: 什么都不做 1: 安全替换方案, 兼容性较好 2: 完全替换方案, 效果较全面。若替换后出现乱码, 请尝试使用1。
; 当 FontLoader=1 时保持启用的状态, 但是所有字体替换的处理会交由 WIN32API 完成。
; 默认: 0 推荐: 1
FontSubstitutes=1

; 强制使用某个字体
; 已弃用的功能。无视所有其他字体, 全系统的字体都会被这里的字体代替。
; 推荐: (禁用)
; ForceChangeFont=Segoe UI

; 让 FreeType 处理的最小字体尺寸
; 0~MaxHeight, 0为不限制, 单位为像素 (px)。
; 默认: 0 推荐: 0
MinHeight=0

; 让 FreeType 处理的最大字体尺寸
; 0~4095 (0xfff), 0为不限制, 单位为像素 (px)。
; 默认: 0 推荐: 0
MaxHeight=0

; DirectWrite 支持
; 对使用 DirectWrite 作为硬件加速技术的程序提供渲染支持开关。
; 0: 禁用 1: 启用
; 推荐: 1
DirectWrite=1

; 仅对指定模块应用渲染
; 0: 排除模式，使用 ExcludeModule、UnloadDll 列表。
; 1: 包含模式，使用 IncludeModule 列表。
; 默认: 0 推荐: 0
UseInclude=0

; 适用显示器列表
; 指定使用 MacType 的显示器。显示器编号列表, 以半角逗号分隔。留空则对所有显示器生效。
; 默认: (禁用) 推荐: (禁用)
; DisplayAffinity=

; FreeType 缓存的最大字形位图内存
; 单位为字节。
; 默认: 10485760 (10MB)
CacheMaxBytes=67108864

; FreeType 缓存的最大字体面数
; 默认: 64
CacheMaxFaces=256

; FreeType 缓存的最大尺寸数 (不同字号的缓存数量)
; 默认: 1200
CacheMaxSizes=33554432

; 备用配置文件
; 指定备用配置文件路径。如需使用请取消注释并填写完整路径。
; 默认: (禁用) 推荐: (禁用)
; AlternativeFile=

; －－－－－渲染设定－－－－－

; 抗锯齿方法
; 1为灰度抗锯齿, 字体边缘不会出现诡异的彩色。2~5为子像素抗锯齿, 若您日常使用察觉不到字体边缘的彩色, 可考虑使用。
; -1: 禁用 0: Normal 1: Light 2: LCD (RGB) 3: LCD (GBR) 4: Light-LCD (RGB) 5: Light-LCD (GBR)
; 默认: 0 推荐: 1
AntiAliasMode=1

; 优先使用点阵
; 小于指定字号的文字将优先使用内嵌点阵。
; 默认: 0 推荐: 10以下
MaxBitmap=9

; 字体 Hinting
; 屏显微调, 使笔画尽量与屏幕像素对齐, 会造成字体变形。禁用 hinting 使字体看上去更真实, 像打印出来的效果。启用 hinting 使字体看上去非常锐利, 对偏好 Windows 风格的人而言改善了可读性。
; 0: Normal 1: NoHinting 2: AutoHinting 3: Light+AutoHinting
; 默认: 0 推荐: 1
HintingMode=1

; 强制对小字体使用 Hinting
; 对9号以下字体自动施加 hinting, 使小字体更锐利。此参数仅在 AntiAliasMode=1/4/5 时有效。
; 0: 禁用 1: 启用
; 默认: 0 推荐: 0
HintSmallFont=0

; 字距调整 (Kerning)
; 0: 禁用 1: 启用
; 默认: 0 推荐: 1
EnableKerning=1

; Gamma 校正模式
; -1: 线性模式, 无 Gamma 校正。
; 0: 使用 GammaValue 参数指定的自定义 Gamma 值。
; 1: 使用 sRGB 标准的 Gamma 校正 (sRGB 曲线, Gamma≈2.4)。
; 2: 混合模式, 将 sRGB 校正和线性校正各取50%平均。
; 默认: -1 推荐: 0
GammaMode=0

; Gamma 值
; GammaMode=0 时该设定才有效。Windows ClearType 的 Gamma 值是1.4, macOS 标准级 Gamma 值是1.8, 电视级 Gamma 值是2.2。若调太小, 黑字会太粗, 白字会太细。若调太大则反之。
; 默认: 1 推荐: 1.6
GammaValue=1.6

; 对比度
; 数值越大越锐利, 数值越小越发虚。具体而言, 对比度越大, 文字边界用来抗锯齿的像素颜色就越偏向文字颜色或者背景颜色 (极端化)。
; 0.0625~10, 1为不调整。
; 默认: 1 推荐: 1
Contrast=1

; 渲染重量
; 数值越大字体就越粗越黑。
; 0~12, 1为不调整。
; 默认: 1 推荐: 1.x
RenderWeight=1.6

; 常规体重量
; -64~64, 0为不调整。
; 默认: 0 推荐: 0
NormalWeight=0

; 粗体重量
; -32~32, 0为不调整。
; 默认: 0 推荐: 0
BoldWeight=0

; 斜体倾斜角度
; -32~32, 0为不调整。
; 默认: 0 推荐: 0
ItalicSlant=0

; 加粗模式
; 模式0可避免 Weight 值过大时, 模式2中在小字号时加粗过度出现斩头的现象。但通过加大 GammaValue、TextTuning 的值, 可以减少 Weight 值过大的造成的效果问题, 在模式2也尽量避免斩头。
; 0: Weight 值大时横向加粗, 值小时双向加粗 1: 总是横向加粗 2: 总是双向加粗, 也就是 FreeType 本身的粗体渲染
; 默认: 0 推荐: 2
BolderMode=2

; 文字边界
; 数值越大越强调背景, 有种文字边界被侵蚀的感觉。适当降低对比度, 提高 TextTuning, 可以使文字周围的颜色看起来淡一点。再加上 RenderWeight, 把这三个设定的微妙平衡调节好的话, 能得到不输给 macOS 的效果。
; 0~12, 0为不调整。当 AntiAliasMode=1 时, 通过 TextTuning 分量来调节。当 AntiAliasMode=2 时, 通过 TextTuningR/G/B 三个分量来调节。
; 默认: 0 推荐: 0
TextTuning=0
TextTuningR=0
TextTuningG=0
TextTuningB=0

; 阴影
; 格式: 水平偏移, 垂直偏移, 深色文字的阴影不透明度 (0~100), 深色文字的阴影颜色, 浅色文字的阴影不透明度 (0~100), 浅色文字的阴影颜色。颜色值格式: BBGGRR。
; 推荐: (禁用)
; Shadow=1,1,40,FFFFFF,40,000000

; 自定义像素模式
; PixelLayout=模式1,模式2,模式3,模式4,模式5,模式6
; 默认: (禁用) 推荐: (禁用)
; PixelLayout=

; 针对液晶显示器的优化
; 0: None 1: Default 2: Light 16: Legacy
; 默认: 0 推荐: 2
LcdFilter=2

; LcdFilterWeight
; LcdFilter>0, 且 AntiAliasMode>-1 时, 该微调才有效。5个值分别代表文字笔画中从左到右的笔画浓度, 取值范围 0~255。当 LcdFilter=1 时, 默认值为 16,64,112,64,16。当 LcdFilter=2 时, 默认值为 0,85,86,85,0。
; 推荐: (禁用)
; LcdFilterWeight=16,64,128,64,16

; 针对以下字体单独设定渲染参数
; 格式: HintingMode, AntiAliasMode, NormalWeight, BoldWeight, ItalicSlant, Kerning
; 推荐: (空)
[Individual]


; －－－－－DirectWrite 设定－－－－－

[DirectWrite]
; 渲染模式
; Sam Toki 亲测, 4及以下的都没法看。但因人而异, 您也可以自行尝试。
; 0: 默认 1: 锯齿 2: 经典 3: 经典自然 4: 自然 5: 自然对称 6: 字体原型
; 默认: 5 推荐: 6
RenderingMode=6

; Gamma 值
; 如果不写则根据上面的 GammaValue 自动计算：(m_fGammaValue^2>1.3?m_fGammaValue^2/2:0.7)。
; 推荐: (禁用)
; GammaValue=1

; 对比度
; 数值越大越锐利, 数值越小越发虚。具体而言, 对比度越大, 文字边界用来抗锯齿的像素颜色就越偏向文字颜色或者背景颜色 (极端化)。
; 0.0625~10, 1为不调整。
; 默认: 1 推荐: 1
Contrast=1

; ClearType 使用程度
; 此设定貌似对某些自带字体渲染配置的程序不起作用。
; 0: 完全采用灰度抗锯齿 1: 完全采用 ClearType 子像素抗锯齿 0~1之间: 两种抗锯齿方法混合使用
; 默认: 1 推荐: 0
ClearTypeLevel=0

; －－－－－实验性功能－－－－－

[Experimental]
; 剪切边界修复
; 0: 禁用 1: 启用
; 默认: 1 推荐: (禁用)
; ClipBoxFix=1

; 彩色字体渲染
; 0: 禁用 1: 启用
; 默认: 0 推荐: (禁用)
; ColorFont=0

; 颜色反转
; 0: 禁用 1: 启用
; 默认: 0 推荐: (禁用)
; InvertColor=0

; －－－－－载入设定2－－－－－

; 仅在以下程序应用渲染
; 需要配置 UseInclude。
; 推荐: (空)
[IncludeModule]


; 针对以下程序, 完全不载入 DLL
; 会与 MacType 主程序同级目录中的 MacType.ini 中的同名配置共同生效。如果发现此设定被修改或移动, 是正常现象。
; 推荐: 字体编辑器, 以及某些游戏
[UnloadDLL]
; MS Office 365 冷启动时弹窗报错。ai.exe 用于支持 Office 的 AI 功能, 无界面。
ai.exe
; ESET 自我防护会反复拦截载入, 消耗性能。如果使用 ESET, 请在 HIPS 中添加规则放行 MacTray.exe、mt64agnt.exe 对所有进程的修改。其它安全软件如有拦截则同理。
efwd.exe
egui.exe
eguiProxy.exe
ekrn.exe
eOppFrame.exe
eServiceHost.exe
FontCreator.exe
FontCreator.cn.exe
Fontforge_EN.exe
Fontforge_SC.exe
Fontforge_TC.exe
; 米哈游启动器运行一段时间后发生闪退。
HYP.exe
HYPHelper.exe
mihomo-alpha.exe
PlantsVsZombies.exe
smartscreen.exe

; 针对以下程序, 载入 DLL 但不渲染
; 会与 MacType 主程序同级目录中的 MacType.ini 中的同名配置共同生效。如果发现此设定被修改或移动, 是正常现象。
; 推荐: (空)
[ExcludeModule]


; －－－－－字体替换设定－－－－－

; 针对以下程序, 不要替换字体
; 可改善兼容问题。会与 MacType 主程序同级目录中的 MacType.ini 中的同名配置共同生效。
; 推荐: 哪个程序的字体显示变怪了, 就把哪个程序加进来
[ExcludeSub]
chrome.exe
Clash for Windows.exe
Code.exe
DingTalk.exe
draw.io.exe
firefox.exe
fontview.exe
GitHubDesktop.exe
msedge.exe
msedgewebview2.exe
PeerBanHelper-GUI.exe
PeerBanHelper-GUI-Silent.exe
SyncTrayzor.exe
TickTick.exe
VSCodium.exe
WeChat.exe

; 字体替换
; 格式: 原字体=目标字体
[FontSubstitutes]
; Microsoft Sans Serif=Sarasa UI J
Tahoma=Sarasa UI J
Segoe UI=Sarasa UI J
Segoe UI Light=Sarasa UI J XLight
Segoe UI SemiLight=Sarasa UI J Light
Segoe UI SemiBold=Sarasa UI J SemiBold
; Segoe UI Black=Sarasa UI J
Segoe UI Variable Small=Sarasa UI J
Segoe UI Variable Small Light=Sarasa UI J XLight
Segoe UI Variable Small SemiLight=Sarasa UI J Light
Segoe UI Variable Small SemiBold=Sarasa UI J SemiBold
Segoe UI Variable Text=Sarasa UI J
Segoe UI Variable Text Light=Sarasa UI J XLight
Segoe UI Variable Text SemiLight=Sarasa UI J Light
Segoe UI Variable Text SemiBold=Sarasa UI J SemiBold
Segoe UI Variable Display=Sarasa UI J
Segoe UI Variable Display Light=Sarasa UI J XLight
Segoe UI Variable Display SemiLight=Sarasa UI J Light
Segoe UI Variable Display SemiBold=Sarasa UI J SemiBold

SimSun=Sarasa UI SC
NSimSun=Sarasa UI SC
Microsoft YaHei UI=Sarasa UI SC
Microsoft YaHei UI Light=Sarasa UI SC XLight

MingLiu=Sarasa UI TC
PMingLiu=Sarasa UI TC
Microsoft JhengHei UI=Sarasa UI TC
Microsoft JhengHei UI Light=Sarasa UI TC XLight

MS UI Gothic=Sarasa UI J
Meiryo UI=Sarasa UI J
; Yu Gothic UI=Sarasa UI J
; Yu Gothic UI Light=Sarasa UI J XLight
; Yu Gothic UI SemiLight=Sarasa UI J Light
; Yu Gothic UI SemiBold=Sarasa UI J SemiBold
